/*
2. Чему будет равен x? 
var a = 2;
var x = 1 + (a *= 2);
*/

/*
х будет равен 5.
Выражение а *= 2 равнозначно а = а * 2, значит сначала выполняется умножение а на 2, затем прибавляется число 1,
в итоге получаем 5.
Скобки обязательны, так как включаем одно выражение в другое (т.е. выполняется вычисление значения переменной а, и выполняется 
вычисление значения х). Проще говоря присутствуют два знака равно. Без скобок будет ошибка, так как слева от знака равно
должно быть кому присвоить, а с право что присвоить
*/
